CSI API ETABS v1
cDatabaseTables.SetTableForEditingCSVFile Method
 Reads a table from a CSV file and adds it to a stored table list until either the ApplyEditedTables(Boolean, Int32, Int32, Int32, Int32, String) or CancelTableEditing() command is issued.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTableForEditingCSVFile(
	string TableKey,
	ref int TableVersion,
	string csvFilePath,
	string sepChar = ","
)
Function SetTableForEditingCSVFile (
	TableKey As String,
	ByRef TableVersion As Integer,
	csvFilePath As String,
	Optional sepChar As String = ","
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim TableVersion As Integer
Dim csvFilePath As String
Dim sepChar As String
Dim returnValue As Integer
returnValue = instance.SetTableForEditingCSVFile(TableKey,
	TableVersion, csvFilePath, sepChar)
int SetTableForEditingCSVFile(
	String^ TableKey,
	int% TableVersion,
	String^ csvFilePath,
	String^ sepChar = L","
)
abstract SetTableForEditingCSVFile :
        TableKey : string *
        TableVersion : int byref *
        csvFilePath : string *
        ?sepChar : string
(* Defaults:
        let _sepChar = defaultArg sepChar ","
*)
-> int
Parameters
TableKey
Type: System.String
Input Item: The table key for a table which has been interactively edited. The table must be one that can be interactively edited.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
csvFilePath
Type: System.String
Input Item: The fully-qualified path for the CSV file containing the table data.
sepChar (Optional)
Type: System.String
Optional Input Item: The delimiter between data items, by default "," . However, please note that this delimiter must match what is used in the csvFilePath file.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace